test/fixtures/files/event_payment_succeeded.json

{
  "id": "evt_1PNL4wP7DAuh0MJON5aXqVvk",
  "object": "event",
  "api_version": "2024-04-10",
  "created": 1717360353,
  "data": {
    "object": {
      "id": "in_1PNJwiP7DAuh0MJOfkFE1KWR",
      "object": "invoice",
      "account_country": "DE",
      "account_name": null,
      "account_tax_ids": null,
      "amount_due": 100,
      "amount_paid": 100,
      "amount_remaining": 0,
      "amount_shipping": 0,
      "application": null,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "enabled": false,
        "liability": null,
        "status": null
      },
      "billing_reason": "subscription_create",
      "charge": "py_3PNKtVP7DAuh0MJO1FybBMxr",
      "collection_method": "send_invoice",
      "created": 1717356000,
      "currency": "eur",
      "custom_fields": null,
      "customer": "customer_id",
      "customer_address": null,
      "customer_email": "leonardo@testemail.com",
      "customer_name": "leonardo jamiroquai",
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "due_date": 1719948000,
      "effective_at": 1717359641,
      "ending_balance": 0,
      "footer": null,
      "from_invoice": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1PMyXgP7DAuh0MJO/test_YWNjdF8xUE15WGdQN0RBdWgwTUpPLF9RRGxUWnBsbHVUcTVRNEJlTVNhczk2bFVNRWRncUNKLDEwNzkwMTE1NA0200ueoCFwlO?s=ap",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1PMyXgP7DAuh0MJO/test_YWNjdF8xUE15WGdQN0RBdWgwTUpPLF9RRGxUWnBsbHVUcTVRNEJlTVNhczk2bFVNRWRncUNKLDEwNzkwMTE1NA0200ueoCFwlO/pdf?s=ap",
      "issuer": {
        "type": "self"
      },
      "last_finalization_error": null,
      "latest_revision": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1PNJwiP7DAuh0MJOaUA0QRtZ",
            "object": "line_item",
            "amount": 100,
            "amount_excluding_tax": 100,
            "currency": "eur",
            "description": "1 xC3x97 data (at xE2x82xAC1.00 / month)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "invoice": "in_1PNJwiP7DAuh0MJOfkFE1KWR",
            "livemode": false,
            "metadata": {},
            "period": {
              "end": 1719948000,
              "start": 1717356000
            },
            "plan": {
              "id": "price_1PNEDWP7DAuh0MJODXlfpYFM",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 100,
              "amount_decimal": "100",
              "billing_scheme": "per_unit",
              "created": 1717333978,
              "currency": "eur",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "meter": null,
              "nickname": null,
              "product": "prod_QDfYW3uHMcpOrB",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1PNEDWP7DAuh0MJODXlfpYFM",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1717333978,
              "currency": "eur",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_QDfYW3uHMcpOrB",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 100,
              "unit_amount_decimal": "100"
            },
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "quantity": 1,
            "subscription": "subscription_id",
            "subscription_item": "si_QDlTsg4dcZJ4Mm",
            "tax_amounts": [],
            "tax_rates": [],
            "type": "subscription",
            "unit_amount_excluding_tax": "100"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1PNJwiP7DAuh0MJOfkFE1KWR/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "number": "4D141AF6-0003",
      "on_behalf_of": null,
      "paid": true,
      "paid_out_of_band": false,
      "payment_intent": "pi_3PNKtVP7DAuh0MJO18LFHMgv",
      "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1717356000,
      "period_start": 1717356000,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "rendering": null,
      "shipping_cost": null,
      "shipping_details": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1717359641,
        "marked_uncollectible_at": null,
        "paid_at": 1717360353,
        "voided_at": null
      },
      "subscription": "subscription_id",
      "subscription_details": {
        "metadata": {}
      },
      "subtotal": 100,
      "subtotal_excluding_tax": 100,
      "tax": null,
      "test_clock": null,
      "total": 100,
      "total_discount_amounts": [],
      "total_excluding_tax": 100,
      "total_tax_amounts": [],
      "transfer_data": null,
      "webhooks_delivered_at": 1717356003
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": null,
    "idempotency_key": "966b2d59-03d2-4b23-a76c-4e57ee5f27e0"
  },
  "type": "invoice.payment_succeeded"
}