test/fixtures/files/event_subscription_creation_success.json

{
  "id": "evt_1PNJrdP7DAuh0MJO9rOT24pw",
  "object": "event",
  "api_version": "2024-04-10",
  "created": 1717355685,
  "data": {
    "object": {
      "id": "sub_1PNJrcP7DAuh0MJO7w8WdxgZ",
      "object": "subscription",
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false,
        "liability": null
      },
      "billing_cycle_anchor": 1717355684,
      "billing_cycle_anchor_config": null,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": null
      },
      "collection_method": "send_invoice",
      "created": 1717355684,
      "currency": "eur",
      "current_period_end": 1719947684,
      "current_period_start": 1717355684,
      "customer": "customer_id",
      "days_until_due": 30,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "ended_at": null,
      "invoice_settings": {
        "account_tax_ids": null,
        "issuer": {
          "type": "self"
        }
      },
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_QDlOpGCsead0FQ",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1717355685,
            "discounts": [],
            "metadata": {},
            "plan": {
              "id": "price_1PNEDWP7DAuh0MJODXlfpYFM",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 100,
              "amount_decimal": "100",
              "billing_scheme": "per_unit",
              "created": 1717333978,
              "currency": "eur",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "meter": null,
              "nickname": null,
              "product": "prod_QDfYW3uHMcpOrB",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1PNEDWP7DAuh0MJODXlfpYFM",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1717333978,
              "currency": "eur",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": "[FILTERED]",
              "metadata": {},
              "nickname": null,
              "product": "prod_QDfYW3uHMcpOrB",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 100,
              "unit_amount_decimal": "100"
            },
            "quantity": 1,
            "subscription": "sub_1PNJrcP7DAuh0MJO7w8WdxgZ",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1PNJrcP7DAuh0MJO7w8WdxgZ"
      },
      "latest_invoice": "in_1PNJrdP7DAuh0MJOm9tsBBhn",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "on_behalf_of": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "price_1PNEDWP7DAuh0MJODXlfpYFM",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 100,
        "amount_decimal": "100",
        "billing_scheme": "per_unit",
        "created": 1717333978,
        "currency": "eur",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "meter": null,
        "nickname": null,
        "product": "prod_QDfYW3uHMcpOrB",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1717355684,
      "status": "active",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_settings": {
        "end_behavior": {
          "missing_payment_method": "create_invoice"
        }
      },
      "trial_start": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_zH6kMOnCXk30bR",
    "idempotency_key": "[FILTERED]"
  },
  "type": "customer.subscription.created"
}